use mermaid instead of plantuml
